<a href="https://colab.research.google.com/github/19PA1A0245/AI-Lab/blob/master/Experiment_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Experiment 2: Pandas

##1.Create a dataframe manually.

In [17]:
import pandas as pd
df=pd.DataFrame([["EEE244","K.POOJITHA",19],["EEE245","K.JAYASREE",20],["EEE246","K.RAZIA",21]],columns = ["Roll No","Name","Age"])
df

  Roll No        Name  Age
0  EEE244  K.POOJITHA   19
1  EEE245  K.JAYASREE   20
2  EEE246     K.RAZIA   21

##2.Different ways of importing a dataframe.

In [18]:
import pandas as pd
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [19]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [20]:
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

In [21]:
df.shape

(117, 9)

##3.Adding,Deleting,Modifying the row/columns in a dataframe.
###3.1)Adding a column

In [22]:
hostler = pd.read_csv("hostlers_day_scholars.csv")
hostler.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [23]:
df["hostler/days scholar"] = hostler.values
df.head()

   Roll No Gender  ... placement status  hostler/days scholar
0        1      M  ...       Not placed                     d
1        2      F  ...           Placed                     d
2        3      F  ...       Not placed                     d
3        4      M  ...       Not placed                     d
4        5      M  ...       Not placed                     h

[5 rows x 10 columns]

###3.2)Deleting a column.

In [24]:
del df["registered_for_ Placement_Training"]
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  hostler/days scholar
0        1      M       A  ...        18        Not placed                     d
1        2      F       A  ...         0            Placed                     d
2        3      F       A  ...        13        Not placed                     d
3        4      M       A  ...        17        Not placed                     d
4        5      M       A  ...        17        Not placed                     h

[5 rows x 9 columns]

###3.3)Adding a row.

In [30]:
df1=pd.DataFrame({"Rollno":[120],"Gender":["F"],"Section":["A"],"SSC Percentage":[9.8],"inter_Diploma_Percentage":[98],"B.Tech_Percentage":[80],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostler"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     120      F  ...               hostler        Not placed

[1 rows x 10 columns]

In [31]:
df=df.append(df1)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
3      4.0      M  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN

[5 rows x 15 columns]

###3.4)Deleting a row.

In [32]:
df=df.drop(2)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
3      4.0      M  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 15 columns]

###3.5)Modifying elements.

In [33]:
df.loc[1,"hostlers/days scholar"] = "hostler"
df.head()

   Roll No Gender  ... placement_status  hostlers/days scholar
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
3      4.0      M  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 16 columns]

##4.Applying functions on a dataframe.

In [37]:
def gracep(x):
  if (x<70):
    return (x+0.05)
  else:
    return (x)

In [39]:
df["B.Tech_Percentage"] = df["B.Tech_Percentage"].apply(gracep)
df.head()

   Roll No Gender  ... placement_status  hostlers/days scholar
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
3      4.0      M  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 16 columns]

##5.Iterations on dataframe.

In [64]:
for index,rows in df[df["B.Tech_Percentage"]>=70].iterrows():
  print(rows["Roll No"]),"-",(rows["B.Tech_Percentage"])

nan

##6.Accessing the elements from a datframe.

In [57]:
df.loc[[3,4],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
3            71.0                      70.4
4             NaN                      65.5

##7.Different ways to deal with NA's in dataframe.

In [58]:
import pandas as pd
import numpy as np
df["SSC Percentage"]=df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... placement_status  hostlers/days scholar
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
3      4.0      M  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 16 columns]

##8.Groupby operations on dataframe.

In [56]:
group = df.groupby("Gender")
group["B.Tech_Percentage"].agg(np.mean)

Gender
F    80.0
M     NaN
Name: B.Tech_Percentage, dtype: float64

##9.Merging the dataframes.

In [59]:
df2=pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban